<?php
class _EZtZEYnK {
    //Базовый контроллер
    public $_drD7;

    public function _FfTa9()
    {

    }

    public static $_Y1639Gk = 'main'; //Базовый шаблон  (названия файла размещёного в папке layout)




//===============================================================     
    public static function _bYAsT($_FGF3n,$_rRT4 = array()) // этот метод для Въюшек .. что бы передовать в них данные 
    {
        self::_3y7(static::$_Y1639Gk,$_FGF3n,$_rRT4);  // вызываем метод класса который у нас описан ниже ... 
    }
//=============================================================== 



//===============================================================    
    public static function _iFa0zQrQ($_FGF3n, $_rRT4 = array())  // 
    {
        $_TbG5B = BASE_PATH .'/view/'.$_FGF3n.'.php';  // 
        if (is_file($_TbG5B)) {
            foreach($_rRT4 as $_eFrHB9ri => $_diBrK5Za){
                $$_eFrHB9ri = $_diBrK5Za;
            }
            include $_TbG5B;
        }
    }
//=============================================================== 



//===============================================================     
    private static function _3y7($_Y1639Gk,$_FGF3n,$_rRT4) // подключаем файлы шаблонов 
    {
        $_TbG5B = BASE_PATH .'/view/layout/'.$_Y1639Gk.'.php'; // составляем адрес к файлу который указали в $_Y1639Gk
        $_8r8N62d = 'args';  // наши будующие переменные но пока это просто строки :)...  
        $_4NFsKN = 'view';
        if (is_file($_TbG5B)) { // проверяем существует ли файл - и то что он являеться обычным файлом 
            $$_8r8N62d = $_rRT4; // в переменную args заносим переданные данные из $_rRT4
            $$_4NFsKN = $_FGF3n; // в переменную view заносим переданные данные из $_FGF3n
            include_once $_TbG5B; // подключаем файл, в нашем случае main.php 
        }

    }
//===============================================================     



}

_EZtZEYnK::$_Y1639Gk = 1;
_EZtZEYnK::_1zf7S('sas',array());
$_1ff1ztY = new _EZtZEYnK();
$_drD7 = new _EZtZEYnK;
$_drD7->$_drD7 = 2;
$_drD7->_FfTa9($_1ff1ztY);